import random

# Захардкоженный loot table, по хорошему вынести логику в отдельный класс!
# mean = 3, scale = 7
LOOT_NUMBERS = [-10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
LOOT_WEIGHTS = [0.013, 0.017, 0.021, 0.026, 0.032, 0.038, 0.044, 0.051, 0.057, 0.062, 0.07, 0.072, 0.073, 0.072, 0.07, 0.067, 0.062, 0.057, 0.051, 0.044]

def get_loot() -> int:
     """
     Возвращает случайный loot согласном распределению.
     """
     return random.choices(LOOT_NUMBERS, weights=LOOT_WEIGHTS, k=1)[0]