import random

# Захардкоженный loot table, по хорошему вынести логику в отдельный класс!
# mean = 6, scale = 7
LOOT_NUMBERS = [-10, -9, -8, -7, -6, -5, -4, -3, -2, -1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
LOOT_WEIGHTS = [0.006, 0.008, 0.011, 0.015, 0.019, 0.024, 0.03, 0.036, 0.043, 0.05, 0.064, 0.07, 0.075, 0.079, 0.082, 0.082, 0.082, 0.079, 0.075, 0.07]

def get_loot() -> int:
     """
     Возвращает случайный loot согласно распределению.
     """
     return random.choices(LOOT_NUMBERS, weights=LOOT_WEIGHTS)[0]